## Plan Result (dev-uksouth-dev)




<pre><code>Plan: 41 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.casetracker.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.casetracker.azurerm_dns_zone.zone
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.certificatedbailiffs.azurerm_dns_zone.zone
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.courtfines.azurerm_dns_zone.zone
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.dev.azurerm_dns_a_record.this[&#34;mailrelay&#34;]
  * module.dev.azurerm_dns_a_record.this[&#34;vh-wowza-public&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.jdbureau&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.jdfrontend&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;afdverify.vh-wowza&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;jdbureau&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;jdfrontend&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.dev.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.dev.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.dev.azurerm_dns_txt_record.this[&#34;_dmarc.mailrelay&#34;]
  * module.dev.azurerm_dns_txt_record.this[&#34;mailrelay&#34;]
  * module.dev.azurerm_dns_zone.zone
  * module.dev.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.immigrationappealsonline.azurerm_dns_zone.zone
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_a041dd4b4af467422ed8129fd9af1b37&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_c67fec9b0864f2bb0714ad20237737b8&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;em6134.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontdoors/sdshmcts-dev"
      + ttl                 = 60
      + zone_name           = "dev.casetracker.justice.gov.uk"
    }

  # module.casetracker.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.casetracker.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.casetracker.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.certificatedbailiffs.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontdoors/sdshmcts-dev"
      + ttl                 = 60
      + zone_name           = "dev.certificatedbailiffs.justice.gov.uk"
    }

  # module.certificatedbailiffs.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.certificatedbailiffs.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.courtfines.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontdoors/sdshmcts-dev"
      + ttl                 = 60
      + zone_name           = "dev.courtfines.direct.gov.uk"
    }

  # module.courtfines.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.courtfines.direct.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.dev.azurerm_dns_a_record.this["mailrelay"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mailrelay"
      + records             = [
          + "20.49.168.141",
          + "20.49.168.17",
          + "51.11.124.149",
          + "51.11.124.158",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_a_record.this["vh-wowza-public"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-wowza-public"
      + records             = [
          + "20.68.204.210",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.hmi-apim"
      + record              = "afdverify.hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3000
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.jdbureau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.jdbureau"
      + record              = "afdverify.sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.jdfrontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.jdfrontend"
      + record              = "afdverify.sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.hmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.toffee"
      + record              = "afdverify.sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["afdverify.vh-wowza"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-wowza"
      + record              = "afdverify.hmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3000
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["jdbureau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jdbureau"
      + record              = "sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["jdfrontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jdfrontend"
      + record              = "sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-dev.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev.azurerm_dns_txt_record.this["@"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "MS=ms74851057"
        }
    }

  # module.dev.azurerm_dns_txt_record.this["_dmarc.mailrelay"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dmarc.mailrelay"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "v=DMARC1; p=none"
        }
    }

  # module.dev.azurerm_dns_txt_record.this["mailrelay"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mailrelay"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "v=spf1 ip4:20.49.168.141 ip4:20.49.168.17 ip4:51.11.124.149 ip4:51.11.124.158 include:spf.protection.outlook.com ~all"
        }
    }

  # module.dev.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.dev.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.immigrationappealsonline.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontdoors/sdshmcts-dev"
      + ttl                 = 60
      + zone_name           = "dev.immigrationappealsonline.justice.gov.uk"
    }

  # module.immigrationappealsonline.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.immigrationappealsonline.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.public-dns.azurerm_dns_cname_record.this["_a041dd4b4af467422ed8129fd9af1b37"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_a041dd4b4af467422ed8129fd9af1b37"
      + record              = "BE33372D30A32248927A2E0C69898A6E.122BACF6D0ACD67EDE96B289A369FE37.OI555FjyjC556tD05Lad.comodoca.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 54000
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_c67fec9b0864f2bb0714ad20237737b8"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_c67fec9b0864f2bb0714ad20237737b8"
      + record              = "F34A65BD30EBB2DFDFB79A4AA2BB1DE2.345B5C367A0AB72A72BDE0D54D9AA0E7.09ce3c5fe952c1b21211.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.hmi-apim"
      + record              = "afdverify.hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3000
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.reformscan"
      + record              = "afdverify.hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["em6134.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em6134.mail-prl-nonprod"
      + record              = "u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3000
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformscan"
      + record              = "hmcts-preview.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s1._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey.mail-prl-nonprod"
      + record              = "s1.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s2._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey.mail-prl-nonprod"
      + record              = "s2.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "preview.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "preview.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 41 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"dev-uksouth-dev","Vars":{}} -->